{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "hallo",
        "hai",
        "halo",
        "hei",
        "hi",
        "hy",
        "pagi",
        "morning",
        "siang",
        "afternoon",
        "sore",
        "malam",
        "bro",
        "sis",
        "kawan"
      ],
      "responses": [
        "Hai, Rock-Bot di sini! Ada yang bisa saya bantu soal penyakit kulit?",
        "Halo, teman! Rock-Bot siap menjawab rasa penasaranmu tentang penyakit kulit.",
        "Hai, saya Rock-Bot! Lagi cari informasi tentang penyakit kulit? Tanyakan saja!",
        "Hai! Rock-Bot hadir untuk membantu kamu mengenal lebih jauh tentang penyakit kulit."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Terima kasih",
        "Dah",
        "Dadah",
        "Bye",
        "Byee",
        "Good bye",
        "Selamat tinggal",
        "Sampai jumpa",
        "Bai",
        "See you"
      ],
      "responses": [
        "Sampai jumpa! Kalau butuh info tentang penyakit kulit lagi, Rock-Bot siap membantu.",
        "Bye-bye! Jaga kesehatan kulitmu ya, dan jangan ragu untuk kembali bertanya!",
        "Selamat tinggal! Semoga informasi tadi bermanfaat. Sampai ketemu lagi!",
        "Dahh, semoga harimu menyenangkan yaa!",
        "Daaah! Rock-Bot pamit dulu ya. Sampai ketemu di lain waktu!",
        "Sampai jumpa lagi! Kalau ada yang mengganggu soal kulit, langsung tanya ke Rock-Bot!"
      ]
    },
    {
      "tag": "terimakasih",
      "patterns": [
        "Thanks",
        "Thank you",
        "Terima kasih",
        "Makasih",
        "Terima kasih banyak"
      ],
      "responses": [
        "Sama-sama! Rock-Bot selalu senang bisa membantu.",
        "Dengan senang hati! Semoga informasinya bermanfaat ya!"
      ]
    },
    {
      "tag": "penyakit_panu",
      "patterns": [
        "Kenapa kulit jadi putih bercak-bercak?",
        "kulit saya terdapat bercak berwarna putih, cokelat, atau merah muda",
        "terdapat bercak putih, cokelat, atau merah pada kulit yang terasa gatal, terutama ketika berkeringat",
        "bercak ini sering muncul di punggung, dada, leher, atau lengan"
      ],
      "responses": [
        "Berdasarkan gejala yang anda sampaikan besar kemungkinan anda terkena penyakit kulit panu (tinea versicolor) yaitu infeksi kulit yang disebabkan oleh jamur."
      ]
    },
    {
      "tag": "penyebab_penyakit_panu",
      "patterns": [
        "gara-gara apa ya saya bisa terkena panu",
        "disebabkan apa saya terkena panu",
        "penyebabnya apa"
      ],
      "responses": [
        "Panu disebabkan oleh jamur Malassezia yang biasanya ada di kulit. Ketidakseimbangan kelembapan kulit, cuaca panas, atau sistem imun yang lemah dapat memicu pertumbuhannya."
      ]
    },
    {
      "tag": "penanganan_penyakit_panu",
      "patterns": [
        "bagaimana cara mengobati panu?",
        "apa panu bisa diobati?"
      ],
      "responses": [
        "Panu bisa diobati dengan krim antijamur seperti miconazole atau clotrimazole, atau menggunakan obat oral jika infeksi cukup parah. Sebaiknya konsultasikan dengan dokter untuk perawatan yang tepat."
      ]
    },
    {
      "tag": "penyakit_kudis",
      "patterns": [
        "Kenapa kulit terasa sangat gatal, terutama di malam hari?",
        "kulit saya muncul ruam kecil-kecil berwarna merah",
        "terasa gatal dengan adanya ruam di sela-sela jari, pergelangan tangan, atau lipatan kulit",
        "apakah ini gejala kudis?"
      ],
      "responses": [
        "Berdasarkan gejala yang anda sampaikan besar kemungkinan anda terkena penyakit kulit yaitu Kudis, atau scabies. Penyakit kulit ini disebabkan oleh tungau kecil bernama Sarcoptes scabiei. Tungau ini masuk ke lapisan kulit dan menyebabkan rasa gatal hebat, terutama di malam hari"
      ]
    },
    {
      "tag": "penyebab_penyakit_kudis",
      "patterns": [
        "apa penyebab kudis?",
        "kenapa saya terkena kudis?",
        "bagaimana bisa terkena kudis?"
      ],
      "responses": [
        "Kudis disebabkan oleh tungau kecil Sarcoptes scabiei yang menggali terowongan di kulit dan menyebabkan rasa gatal. Penularan biasanya terjadi melalui kontak langsung kulit dengan penderita atau melalui barang-barang pribadi."
      ]
    },
    {
      "tag": "penanganan_penyakit_kudis",
      "patterns": [
        "bagaimana cara mengobati kudis?",
        "obat apa untuk kudis?",
        "cara mengatasi kudis"  
      ],
      "responses": [
        "Kudis dapat diobati dengan krim atau losion seperti permethrin atau ivermectin. Pastikan Anda juga mencuci semua pakaian dan seprai untuk mencegah penularan ulang."
      ]
    },
    {
      "tag": "penyakit_biduran",
      "patterns": [
        "Kenapa kulit saya terasa gatal dengan bercak merah yang menonjol?",
        "saya sering muncul bentol merah yang hilang timbul",
        "kulit terasa panas dan gatal dengan bentol-bentol besar"
      ],
      "responses": [
        "Gejala yang Anda sampaikan menunjukkan kemungkinan Anda mengalami biduran (urtikaria), yaitu reaksi alergi yang menyebabkan ruam atau bentol merah pada kulit."
      ]
    },
    {
      "tag": "penyebab_penyakit_biduran",
      "patterns": [
        "apa penyebab biduran?",
        "kenapa saya bisa biduran?",
        "faktor apa yang memicu biduran?"
      ],
      "responses": [
        "Biduran biasanya disebabkan oleh reaksi alergi terhadap makanan, obat-obatan, gigitan serangga, suhu ekstrem, atau stres."
      ]
    },
    {
      "tag": "penanganan_penyakit_biduran",
      "patterns": [
        "bagaimana cara mengobati biduran?",
        "apakah biduran bisa sembuh?",
        "cara mengatasi biduran"
      ],
      "responses": [
        "Biduran biasanya dapat diatasi dengan antihistamin untuk mengurangi rasa gatal dan peradangan. Jika parah, konsultasikan dengan dokter untuk perawatan lebih lanjut."
      ]
    },
    {
      "tag": "penyakit_cacar",
      "patterns": [
        "Kenapa kulit saya muncul bintik merah yang berisi cairan?",
        "saya mengalami demam dan muncul lenting-lenting kecil",
        "kulit terasa gatal dengan bintik-bintik berisi cairan"
      ],
      "responses": [
        "Berdasarkan gejala yang Anda sampaikan, besar kemungkinan Anda terkena cacar air (varicella). Penyakit ini disebabkan oleh virus varicella-zoster dan sering menyerang anak-anak."
      ]
    },
    {
      "tag": "penyebab_penyakit_cacar",
      "patterns": [
        "apa penyebab cacar?",
        "bagaimana saya bisa terkena cacar?",
        "dari mana asal virus cacar?"
      ],
      "responses": [
        "Cacar air disebabkan oleh infeksi virus varicella-zoster. Virus ini menular melalui kontak langsung dengan cairan lenting atau melalui percikan udara dari batuk dan bersin penderita."
      ]
    },
    {
      "tag": "penanganan_penyakit_cacar",
      "patterns": [
        "bagaimana cara mengobati cacar?",
        "obat apa untuk cacar?",
        "cara mengatasi cacar air"
      ],
      "responses": [
        "Cacar air biasanya sembuh sendiri dalam 1-2 minggu. Anda bisa mengonsumsi obat pereda nyeri dan antihistamin untuk mengurangi gatal. Hindari menggaruk lenting untuk mencegah infeksi."
      ]
    },
    {
      "tag": "penyakit_eksim",
      "patterns": [
        "apa penyebab eksim?",
        "kenapa saya terkena eksim?",
        "apa faktor yang memicu eksim?"
      ],
      "responses": [
        "Gejala yang Anda sampaikan menunjukkan kemungkinan Anda terkena eksim (dermatitis atopik), yaitu peradangan kronis pada kulit."
      ]
    },
    {
      "tag": "penyebab_penyakit_eksim",
      "patterns": [
        "apa penyebab eksim?",
        "kenapa saya terkena eksim?",
        "apa faktor yang memicu eksim?"
      ],
      "responses": [
        "Eksim disebabkan oleh kombinasi faktor genetik, sistem imun yang sensitif, dan pemicu eksternal seperti alergen, stres, atau iritasi dari bahan kimia tertentu."
      ]
    },
    {
      "tag": "penanganan_penyakit_eksim",
      "patterns": [
        "bagaimana cara mengobati eksim?",
        "obat apa untuk eksim?",
        "cara mengatasi eksim"
      ],
      "responses": [
        "Eksim dapat dikelola dengan pelembap, krim kortikosteroid, dan menghindari pemicu iritasi. Jika parah, dokter mungkin akan meresepkan obat oral atau terapi cahaya."
      ]
    },
    {
      "tag": "penyakit_kurap",
      "patterns": [
        "Kenapa kulit saya muncul bercak melingkar yang bersisik?",
        "saya merasa gatal dengan bercak merah berbentuk cincin di kulit",
        "terdapat area kulit yang terangkat dengan tepi yang merah dan aktif"
      ],
      "responses": [
        "Berdasarkan gejala yang Anda sampaikan, besar kemungkinan Anda terkena kurap (ringworm). Kurap adalah infeksi jamur yang bisa muncul di kulit, rambut, atau kuku."
      ]
    },
    {
      "tag": "penyebab_penyakit_kurap",
      "patterns": [
        "apa penyebab kurap?",
        "bagaimana saya bisa terkena kurap?",
        "dari mana asal kurap?"
      ],
      "responses": [
        "Kurap disebabkan oleh infeksi jamur dermatofita yang tumbuh di area kulit lembap. Penularan bisa terjadi melalui kontak langsung atau benda yang terkontaminasi."
      ]
    },
    {
      "tag": "penanganan_penyakit_kurap",
      "patterns": [
        "bagaimana cara mengobati kurap?",
        "obat apa untuk kurap?",
        "cara mengatasi kurap"
      ],
      "responses": [
        "Kurap dapat diobati dengan krim antijamur seperti clotrimazole atau terbinafine. Jika infeksi meluas, dokter mungkin akan meresepkan obat antijamur oral."
      ]
    }
  ]
}
